In [144]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
from pprint import pprint
from urllib.error import HTTPError
import random

In [145]:
post_secondary_csv = pd.read_csv("Postsecondary_School_Location_201718.csv")
post_secondary_complete_df = pd.DataFrame(post_secondary_csv)
post_secondary_df = post_secondary_complete_df[["STATE", "NMCNTY"]]
post_secondary_df= post_secondary_df.rename(columns = {"NMCNTY":"county"})
post_secondary_df.head()

  STATE           county
0    GA   Carroll County
1    GA     Towns County
2    HI  Honolulu County
3    HI    Hawaii County
4    HI  Honolulu County

In [146]:
post_secondary_df=post_secondary_df.replace(regex=['County'], value='')
post_secondary_df['county'] = post_secondary_df['county'].str.strip()
post_secondary_df.head()

  STATE    county
0    GA   Carroll
1    GA     Towns
2    HI  Honolulu
3    HI    Hawaii
4    HI  Honolulu

In [147]:
post_secondary_df["county"] = post_secondary_df["county"].map(str) + ", "+ post_secondary_df["STATE"]
post_secondary_df.head()

  STATE        county
0    GA   Carroll, GA
1    GA     Towns, GA
2    HI  Honolulu, HI
3    HI    Hawaii, HI
4    HI  Honolulu, HI

In [148]:
post_secondary_df = post_secondary_df["county"]
print(post_secondary_df)

0         Carroll, GA
1           Towns, GA
2        Honolulu, HI
3          Hawaii, HI
4        Honolulu, HI
            ...
7594       Uintah, UT
7595        Cache, UT
7596         Utah, UT
7597    Salt Lake, UT
7598    Salt Lake, UT
Name: county, Length: 7599, dtype: object

In [149]:
post_sec_counts = post_secondary_df.value_counts()
print(post_sec_counts)

Los Angeles, CA    228
Cook, IL           125
Maricopa, AZ        92
New York, NY        91
Miami-Dade, FL      88
                  ...
Adair, KY            1
Jackson, AR          1
Hardin, IA           1
Franklin, ME         1
Leflore, MS          1
Name: county, Length: 1512, dtype: int64

In [150]:
post_sec_df = pd.DataFrame()
post_sec_df["counts"]=post_sec_counts
post_sec_df = post_sec_df.reset_index(drop=False)
post_sec_df = post_sec_df.rename(columns = {"index":"county"})
post_sec_df.head()

            county  counts
0  Los Angeles, CA     228
1         Cook, IL     125
2     Maricopa, AZ      92
3     New York, NY      91
4   Miami-Dade, FL      88

## Testing to see if can analyze now with county data so copied it over here

In [151]:
county_raw = pd.read_excel("county_name.xls", sheet_name = "EDU01A", usecols = "A")

In [152]:
county = county_raw[~county_raw.Area_name.str.contains(",") == False]

In [153]:
county = county.reset_index(drop = True)
county = county.rename(columns={"Area_name": "county"})

In [154]:
random_counties = county.sample(n=1400)
random_counties = random_counties.reset_index(drop=True)
random_counties.head()

           county
0  Monongalia, WV
1     Orleans, NY
2    Wicomico, MD
3     Bedford, VA
4       Cecil, MD

In [155]:
random_counties = random_counties.county.astype(str) #may need to do this in the counties doc could get same error for all when go to analyze
post_sec_analysis = pd.DataFrame()
post_sec_analysis["county"]=random_counties
post_sec_analysis.head()

           county
0  Monongalia, WV
1     Orleans, NY
2    Wicomico, MD
3     Bedford, VA
4       Cecil, MD

In [156]:
post_sec_analysis = post_sec_analysis.merge(post_sec_df, on="county")
merged_test.head()

          county  counts
0   Hennepin, MN      36
1    Forsyth, NC       9
2  Brunswick, NC       1
3       Cobb, GA      13
4    Dickson, TN       1

In [157]:
print(len(post_sec_analysis))

614